import React from "react";
import Image from "next/image";
import Link from "next/link";
import Slider from "../components/Slider";
import {
  BannerWrap,
  BannerRight,
  BannerLeft,
  Logo,
  LogoText,
  BannerText,
  BigText,
} from "../styles/BannerBio";

function Banner() {
  return (
    <BannerWrap>
      <BannerLeft>
        <Logo>
          <Image src="/piano.svg" width={30} height={30} />
          <LogoText>
            <Link href="/">Мелодрам</Link>
          </LogoText>
        </Logo>
        <BannerText>
          <BigText>Дејана Банковић</BigText>
          <br></br>
          рођена је 18. новембра 1983.године у Крагујевцу. Основну школу и
          Основну музичку школу, одсек клавир, завршава у Лапову. Након завршене
          Средње музичке школе, образовни профил музички извођач/клавириста,
          завршава Факултет музичке уметности, смер-општа музичка педагогија.{" "}
          <br></br>
          <br></br>
          Поред дугогодишњег искуства у раду са Црквеним хором „Свети Јован
          Дамаскин“, недавно је почела рад и са Певачким друштвом „Икос“ чији је
          уметнички руководилац, а који се бави неговањем духовне и изворне
          музике.
          <br></br>
          <br></br>
          Од 2008. године до 2018. ради на месту наставника клавира у ОМШ
          „Божидар Трудић“. Са ученицима је током рада учествовала како на
          школским, тако и на међународним и интернационалним такмичењима у
          нашој земљи и то као ментор, а на појединим такмичењима и као члан
          жирија. Поред тога има искуства у настави солфеђа са ванредним
          ученицима. Од 2005. године се бави компоновањем и члан је удружења
          „Жене у музици“ Србија.
          <br></br>
          <br></br>
          2005. године I награда на интернационалном такмичењу Удружења „Жене у
          музици“ са композицијом Агри Даги, за клавир.
          <br></br>
          <br></br>
          2009. године I награда на интернационалном такмичењу Удружења „Жене у
          музици“ у пројекту“Млади за правду и мир“ са композицијом Етида, за
          клавир.
          <br></br>
          <br></br>
          2011. године објављена композиторска биографија Дејане Банковић
          (Милошевић) како у српској, тако и у европској енциклопедији жена у
          музици.
          <br></br>
          <br></br>
          2013. године изведена Соната за виолину у оквиру X јубиларног
          међународног фестивала удружења „Жене у музици“ и пројекта „Млади за
          правду и мир“ у свечаној сали Прве гимназије у Крагујевцу.
          <br></br>
          <br></br>
          2014. године I награда на интернационалном такмичењу Удружења „Жене у
          музици“ у пројекту „Млади за правду и мир“ са композицијом Бели змај,
          за виолину и клавир.
        </BannerText>
      </BannerLeft>
      <BannerRight>
        <br></br>
        <br></br>
        2014. године једина номинована композиторка из Србије за стручно
        усавршавање у Италији.
        <br></br>
        <br></br>
        2014. године изведена композиција „Lady with a swan feather” за гитару у
        Италији.
        <br></br>
        <br></br>
        2017. године изведена композиција инспирисана романом Градимира
        Стојковића, „Хајдук у Београду“ за две виолине на сајму књига у
        Београду.
        <br></br>
        <br></br>
        2018. године на предлог Општине Лапово добија малу плакету као диригент
        хора за изузетну сарадњу.
        <br></br>
        <br></br>
        2018. године објављена химна Светом Роману у тематском зборнику
        "Јухорски запис" 2018. године обавља шеснаесточасовну обуку и едукацију
        васпитача и деце за хор и хорско певање у Установи за децу предшколског
        узраста „Наша младост“ Лапово. Октобра, 2018.године је постављена на
        место в.д. директора Културно-туристичког центра „Стефан Немања“ Лапово,
        а потом,годину дан касније на место директора.
        <br></br>
        <br></br>
        Септембра 2019.године са хором снима прве духовне песме у крипти Храма
        Светог Саве са Телевизијом Храм. Песма "Радуј се Параскево" чији је
        аутор и композитор Његош Стикић, на такмичењу Телевизије Храм осваја
        2.место.
        <br></br>
        <br></br>
        Крајем 2019. године оснива Певачко друштво "Икос" с којим је имала
        наступе на разним манифестацијама и концертима, од којих се истичу
        "Добричина праскозорја" и "У сусрет Сретењу" у Крагујевцу 2020. године
        на предлог Општине Лапово добија малу плакету за најуспешнију установу у
        области културе током 2019.г.
        <Slider />
      </BannerRight>
  
    </BannerWrap>
  );
}

export default Banner;
