import React, { useState } from "react";
import axios from "axios";
import {
  MainForm,
  FormContainer,
  FormLabel,
  FormInput,
  FlexItem,
  Button,
  TextArea,
  Error,
  Message,
  FormText,
  Social,
  FlexSocial,
  Link,
} from "../styles/Form";

export default function ContactForm() {
  const [status, setStatus] = useState({
    submitted: false,
    submitting: false,
    info: { error: false, msg: null },
  });

  const [inputs, setInputs] = useState({
    Name: "",
    Email: "",
    Number: "",
    Message: "",
  });

  const handleServerResponse = (ok, msg) => {
    if (ok) {
      setStatus({
        submitted: true,
        submitting: false,
        info: { error: false, msg: msg },
      });

      setInputs({
        Name: "",
        Email: "",
        Number: "",
        Message: "",
      });
    } else {
      setStatus({
        info: { error: true, msg: msg },
      });
    }
  };

  const handleOnChange = (e) => {
    e.persist();

    setInputs((prev) => ({
      ...prev,
      [e.target.id]: e.target.value,
    }));

    setStatus({
      submitted: false,
      submitting: false,
      info: { error: false, msg: null },
    });
  };

  const handleOnSubmit = (e) => {
    e.preventDefault();
    setStatus((prevStatus) => ({ ...prevStatus, submitting: true }));
    axios({
      method: "POST",
      url: "https://formspree.io/f/xleookly",
      data: inputs,
    })
      .then((response) => {
        handleServerResponse(true, "Хвала Вам, Ваша порука је послата.");
      })
      .catch((error) => {
        handleServerResponse(false, error.response.data.error);
      });
  };

  return (
    <>
      <div className="container-form">
        <FormText>
          Заказивање термина и више информација о часовима, можете добити преко
          телефона:
          <br></br>
          <br></br>
          +381 60 4560 068
          <br></br>
          <br></br>
          Или путем форме.
        </FormText>
      </div>

      <div className="container-form">
        <MainForm>
          <FormContainer onSubmit={handleOnSubmit}>
            <FlexItem>
              <FormLabel htmlFor="name">Ваше име:</FormLabel>
              <FormInput
                id="Name"
                type="Name"
                name="_replyto"
                onChange={handleOnChange}
                required
                value={inputs.Name}
              />
            </FlexItem>
            <FlexItem>
              <FormLabel htmlFor="Email">Ваша е-мејл адреса:</FormLabel>
              <FormInput
                id="Email"
                type="Email"
                name="_replyto"
                onChange={handleOnChange}
                required
                value={inputs.Email}
              />
            </FlexItem>

            <FlexItem>
              <FormLabel htmlFor="Number">Ваш број телефона:</FormLabel>
              <FormInput
                id="Number"
                type="Number"
                name="_replyto"
                onChange={handleOnChange}
                required
                value={inputs.Number}
              />
            </FlexItem>
            <FlexItem>
              <FormLabel htmlFor="Message">Ваша порука или питање:</FormLabel>
              <TextArea
                id="Message"
                name="Message"
                onChange={handleOnChange}
                required
                value={inputs.Message}
              />
            </FlexItem>

            <Button type="submit" disabled={status.submitting}>
              {!status.submitting
                ? !status.submitted
                  ? "Пошаљи"
                  : "Послато"
                : "Шаље се..."}
            </Button>
          </FormContainer>
          {status.info.error && <Error>Error: {status.info.msg}</Error>}
          {!status.info.error && status.info.msg && (
            <Message>{status.info.msg}</Message>
          )}
          <Social>
            Мелодром је доступан и преко мејла или друштвених мрежа:
          </Social>
          <FlexSocial>
            <Link href="mailto:melodromradionica@yahoo.com">
              <svg
                style={{ margin: "10px" }}
                width="30px"
                height="30px"
                fill="white"
                viewBox="0 -100 512.00002 512"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path d="m494.535156 0h-477.070312c-9.628906 0-17.464844 7.835938-17.464844 17.464844v276.453125c0 9.628906 7.835938 17.460937 17.464844 17.460937h477.070312c9.628906 0 17.464844-7.832031 17.464844-17.460937v-276.453125c0-9.628906-7.835938-17.464844-17.464844-17.464844zm-464.503906 43.027344 143.507812 95.382812-143.507812 124.921875zm225.96875 114.128906-191.265625-127.125h382.53125zm-56.523438-1.511719 46.855469 31.144531c2.9375 1.953126 6.300781 2.929688 9.667969 2.929688 3.363281 0 6.730469-.980469 9.667969-2.929688l46.855469-31.144531 144.402343 125.703125h-401.851562zm138.984376-17.238281 143.507812-95.382812v220.308593zm0 0" />
              </svg>
            </Link>
            <Link
              href="https://facebook.com/melodrom.rs"
              target="_blank"
              rel="noreferrer"
            >
              <svg
                style={{ margin: "10px" }}
                width="30px"
                height="30px"
                fill="white"
                viewBox="-110 1 511 511.99996"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path d="m180 512h-81.992188c-13.695312 0-24.835937-11.140625-24.835937-24.835938v-184.9375h-47.835937c-13.695313 0-24.835938-11.144531-24.835938-24.835937v-79.246094c0-13.695312 11.140625-24.835937 24.835938-24.835937h47.835937v-39.683594c0-39.347656 12.355469-72.824219 35.726563-96.804688 23.476562-24.089843 56.285156-36.820312 94.878906-36.820312l62.53125.101562c13.671875.023438 24.792968 11.164063 24.792968 24.835938v73.578125c0 13.695313-11.136718 24.835937-24.828124 24.835937l-42.101563.015626c-12.839844 0-16.109375 2.574218-16.808594 3.363281-1.152343 1.308593-2.523437 5.007812-2.523437 15.222656v31.351563h58.269531c4.386719 0 8.636719 1.082031 12.289063 3.121093 7.878906 4.402344 12.777343 12.726563 12.777343 21.722657l-.03125 79.246093c0 13.6875-11.140625 24.828125-24.835937 24.828125h-58.46875v184.941406c0 13.695313-11.144532 24.835938-24.839844 24.835938zm-76.8125-30.015625h71.632812v-193.195313c0-9.144531 7.441407-16.582031 16.582032-16.582031h66.726562l.027344-68.882812h-66.757812c-9.140626 0-16.578126-7.4375-16.578126-16.582031v-44.789063c0-11.726563 1.191407-25.0625 10.042969-35.085937 10.695313-12.117188 27.550781-13.515626 39.300781-13.515626l36.921876-.015624v-63.226563l-57.332032-.09375c-62.023437 0-100.566406 39.703125-100.566406 103.609375v53.117188c0 9.140624-7.4375 16.582031-16.578125 16.582031h-56.09375v68.882812h56.09375c9.140625 0 16.578125 7.4375 16.578125 16.582031zm163.0625-451.867187h.003906zm0 0" />
              </svg>
            </Link>

            <Link
              href="https://www.youtube.com/channel/UC2FcLkr7emc0nPCc6fvz9jg"
              target="_blank"
              rel="noreferrer"
            >
              <svg
                style={{ margin: "10px" }}
                width="30px"
                height="30px"
                fill="white"
                viewBox="0 -62 512.00199 512"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path d="m334.808594 170.992188-113.113282-61.890626c-6.503906-3.558593-14.191406-3.425781-20.566406.351563-6.378906 3.78125-10.183594 10.460937-10.183594 17.875v122.71875c0 7.378906 3.78125 14.046875 10.117188 17.832031 3.308594 1.976563 6.976562 2.96875 10.652344 2.96875 3.367187 0 6.742187-.832031 9.847656-2.503906l113.117188-60.824219c6.714843-3.613281 10.90625-10.59375 10.9375-18.222656.027343-7.628906-4.113282-14.640625-10.808594-18.304687zm-113.859375 63.617187v-91.71875l84.539062 46.257813zm0 0" />
                <path d="m508.234375 91.527344-.023437-.234375c-.433594-4.121094-4.75-40.777344-22.570313-59.421875-20.597656-21.929688-43.949219-24.59375-55.179687-25.871094-.929688-.105469-1.78125-.203125-2.542969-.304688l-.894531-.09375c-67.6875-4.921874-169.910157-5.5937495-170.933594-5.59765575l-.089844-.00390625-.089844.00390625c-1.023437.00390625-103.246094.67578175-171.542968 5.59765575l-.902344.09375c-.726563.097657-1.527344.1875-2.398438.289063-11.101562 1.28125-34.203125 3.949219-54.859375 26.671875-16.972656 18.445312-21.878906 54.316406-22.382812 58.347656l-.058594.523438c-.152344 1.714844-3.765625 42.539062-3.765625 83.523437v38.3125c0 40.984375 3.613281 81.808594 3.765625 83.527344l.027344.257813c.433593 4.054687 4.746093 40.039062 22.484375 58.691406 19.367187 21.195312 43.855468 24 57.027344 25.507812 2.082031.238282 3.875.441406 5.097656.65625l1.183594.164063c39.082031 3.71875 161.617187 5.550781 166.8125 5.625l.15625.003906.15625-.003906c1.023437-.003907 103.242187-.675781 170.929687-5.597657l.894531-.09375c.855469-.113281 1.816406-.214843 2.871094-.324218 11.039062-1.171875 34.015625-3.605469 54.386719-26.019532 16.972656-18.449218 21.882812-54.320312 22.382812-58.347656l.058594-.523437c.152344-1.71875 3.769531-42.539063 3.769531-83.523438v-38.3125c-.003906-40.984375-3.617187-81.804687-3.769531-83.523437zm-26.238281 121.835937c0 37.933594-3.3125 77-3.625 80.585938-1.273438 9.878906-6.449219 32.574219-14.71875 41.5625-12.75 14.027343-25.847656 15.417969-35.410156 16.429687-1.15625.121094-2.226563.238282-3.195313.359375-65.46875 4.734375-163.832031 5.460938-168.363281 5.488281-5.082032-.074218-125.824219-1.921874-163.714844-5.441406-1.941406-.316406-4.039062-.558594-6.25-.808594-11.214844-1.285156-26.566406-3.042968-38.371094-16.027343l-.277344-.296875c-8.125-8.464844-13.152343-29.6875-14.429687-41.148438-.238281-2.710937-3.636719-42.238281-3.636719-80.703125v-38.3125c0-37.890625 3.304688-76.914062 3.625-80.574219 1.519532-11.636718 6.792969-32.957031 14.71875-41.574218 13.140625-14.453125 26.996094-16.054688 36.160156-17.113282.875-.101562 1.691407-.195312 2.445313-.292968 66.421875-4.757813 165.492187-5.464844 169.046875-5.492188 3.554688.023438 102.589844.734375 168.421875 5.492188.808594.101562 1.691406.203125 2.640625.3125 9.425781 1.074218 23.671875 2.699218 36.746094 16.644531l.121094.128906c8.125 8.464844 13.152343 30.058594 14.429687 41.75.226563 2.558594 3.636719 42.171875 3.636719 80.71875zm0 0" />
              </svg>
            </Link>
          </FlexSocial>
        </MainForm>
      </div>
    </>
  );
}
